# Exercício 23 MiniBoss - Coop

## - Carregar os Dados (do Discord): credit_scoring_eng
## - Realize a Análise Exploratória: Utilize funções para verificar a estrutura do conjunto de dados (ex: head(), info()). Descreva brevemente o que cada coluna significa.

In [1]:
import pandas as pd

credit_scoring_eng = pd.read_csv('credit_scoring_eng.csv')
credit_scoring_eng

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,masters degree,0,married,0,F,employee,0,253875.639453,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,112080.014102,car purchase
2,0,-5623.422610,33,Secondary Education,1,married,0,M,employee,0,145885.952297,purchase of the house
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,267628.550329,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,158616.077870,to have a wedding
...,...,...,...,...,...,...,...,...,...,...,...,...
21520,1,-4529.316663,43,secondary education,1,civil partnership,1,F,partner,0,224791.862382,housing transactions
21521,0,343937.404131,67,secondary education,1,married,0,F,retiree,0,155999.806512,purchase of a car
21522,1,-2113.346888,38,secondary education,1,civil partnership,1,M,employee,1,89672.561153,property
21523,3,-3112.481705,38,secondary education,1,married,0,M,employee,1,244093.050500,buying my own car
21524,2,-1984.507589,40,secondary education,1,married,0,F,employee,0,82047.418899,to buy a car

In [2]:
credit_scoring_eng.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,masters degree,0,married,0,F,employee,0,253875.639453,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,112080.014102,car purchase
2,0,-5623.422610,33,Secondary Education,1,married,0,M,employee,0,145885.952297,purchase of the house
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,267628.550329,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,158616.077870,to have a wedding

In [3]:
credit_scoring_eng.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [4]:
#anotações sobre os id's

credit_scoring_eng.

#masters degree = 0
#secondary education = 1
#bachelor degree = 2
#primary education = 3
#academic degree = 4

#married = 0
#civil partnership = 1
#widow / widower = 2
#divorced = 3
#unmaried = 4

### Número de Colunas: 12
### - children - Coluna que conta a quantidade de filhos da pessoa
### - days_employed - Conta os dias que a pessoa está empregada (com os valores positivos) e se está desempregada (valores negativos)
### - dob_years - Refere-se à data de nascimento da pessoa, mas contada em anos.
### - education - A formação mais alta de ensino que a pessoa têm
### - education_id - refere-se ao id de cada tipo de ensino registrado, sendo 0 = masters degree, 1 = secondary education, 2 = bachelor degree, 3 = primary education, 4 = academic degree.
### - family_status - Coluna que se refere ao status familiar da pessoa
### - family_status_id -